time = input("Введите время в формате hh:mm: ")

res = time.split(":") 
h = int(res[0]) 
min = int(res[1])
print (f'h={h}; min={min}')
h_dict = { 
    0: "двенадцать",
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять",
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: "один",
    14: "два",
    15: "три",
    16: "четыре",
    17: "пять",
    18: "шесть",
    19: "семь",
    20: "восемь",
    21: "девять",
    22: "десять",
    23: "одиннадцать"
    }
h_not_even_dict = {
    0: "двенадцатого",
    1: "первого",
    2: "второго",
    3: "третьего",
    4: "четвёртого",
    5: "пятого",
    6: "шестого",
    7: "седьмого",
    8: "восьмого",
    9: "девятого",
    10: "десятого",
    11: "одиннадцатого",
    12: "двенадцатого",
    13: "первого",
    14: "второго",
    15: "третьего",
    16: "четвёртого",
    17: "пятого",
    18: "шестого",
    29: "седьмого",
    20: "восьмого",
    21: "девятого",
    22: "десятого",
    23: "одиннадцатого",
    }
m_dict = {
    13: "тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать",
    20: "двадцать",
    21: "двадцать один",
    22: "двадцать два",
    23: "двадцать три",
    24: "двадцать четыре",
    25: "двадцать пять",
    26: "двадцать шесть",
    27: "двадцать семь",
    28: "двадцать восемь",
    29: "двадцать девять",
    
    31: "тридцать один",
    32: "тридцать два",
    33: "тридцать три",
    34: "тридцать четыре",
    35: "тридцать пять",
    36: "тридцать шесть",
    37: "тридцать семь",
    38: "тридцать восемь",
    39: "тридцать девять",
    40: "сорок",
    41: "сорок один",
    42: "сорок два",
    43: "сорок три",
    44: "сорок четыре",
    
}


if min == 0:   
    if h==1 or h==13: print (f'{time} - {h_dict[h]} час ровно')
    elif 1<h<5 or 13<h<17: print (f'{time} - {h_dict[h]} часа ровно')
    else: print(f'{time} - {h_dict[h]} часов ровно')
elif 0<min<13: print (f'{time} - {h_dict[min]} минут {h_not_even_dict [h+1]}')
elif 12<min<30: print (f'{time} - {m_dict[min]} минут {h_not_even_dict [h+1]}')
elif min==30: print (f'{time} - половина {h_not_even_dict [h+1]}') 





if minutes == 0: print(f"{hours:02d}:{minutes:02d} - {hours_dict[hours]} час ровно") 
elif minutes < 30: print(f"{hours:02d}:{minutes:02d} - {minutes} минут следующего часа ({hours_dict[hours+1]})") 
elif minutes == 30: print(f"{hours:02d}:{minutes:02d} - половина {hours_dict[hours]}") 
elif minutes > 30 and minutes < 45: print(f"{hours:02d}:{minutes:02d} - {minutes} минут следующего часа ({hours_dict[hours+1]})") 
elif minutes >= 45: print(f"{hours:02d}:{minutes:02d} - без {60 - minutes} минут {hours_dict[hours+1]}")